/**
 * Пакет calculator содержит классы и интерфейсы, которые используются для выполнения математических операций.
 * Он предоставляет функциональность для расчета среднего значения списка чисел.
 * Класс ListAverageCalculator используется для расчета среднего значения списка чисел.
 * Он реализует интерфейс AverageCalculator и предоставляет метод для расчета среднего значения списка.
 * Класс DoubleListAverageCalculator расширяет ListAverageCalculator и переопределяет метод calculateAverage() для работы
 * с списком чисел типа Double. Он реализует интерфейс AverageCalculator и предоставляет метод для расчета среднего
 * значения списка чисел типа Double.
 * Интерфейс AverageCalculator определяет метод для расчета среднего значения чисел обобщенного типа T.
 * @version 0.0.1
 * @author Ivan B.
 */

package org.example.calculator;
