package org.example;
/**
 *
 * Домашнее задание по блоку Unit-тесты;
 * Программа на Java принимает два списка чисел и выполняет следующие действия:
 * Сравнивает эти средние значения и выводит соответствующее сообщение:
 * - ""Первый список имеет большее среднее значение"", если среднее значение первого списка больше.
 * - ""Второй список имеет большее среднее значение"", если среднее значение второго списка больше.
 * - ""Средние значения равны"", если средние значения списков равны.
 * В приложении содержатся тесты Junit
 * @author Ivan B.
 * @version 0.0.1
 *
 */